Revit 2026 API

# FabricationRodInfo Class

---

The rod information of the fabrication part.

SystemObject Autodesk.Revit.DBFabricationRodInfo

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FabricationRodInfo : IDisposable
```
```vb
Public Class FabricationRodInfo
	Implements IDisposable
```
```cpp
public ref class FabricationRodInfo : IDisposable
```
```fsharp
type FabricationRodInfo =
    class
        interface IDisposable
    end
```

The FabricationRodInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CanRodsBeHosted | Controls whether the hanger's rod's will be automatically hosted by other elements. |
|  | IsAttachedToStructure | Checks if the hanger is attached to structure. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | RodCount | Gets the number of rods. |

|  | Name | Description |
| --- | --- | --- |
|  | AttachToHanger | Attaches the hanger rod to another bearer hanger. |
|  | AttachToStructure | Attaches to the nearest structural element. |
|  | Dispose | Releases all resources used by the FabricationRodInfo |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBearerExtension | Gets the bearer extension. The method is applicable only for bearer hanger. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetRodAttachedElementId | Gets the identifier of the attached component for the specified rod. |
|  | GetRodEndPosition | Gets the position of the rod end. |
|  | GetRodLength | Get the current rod length. If the rod is the length will include structural extension. |
|  | GetRodStructureExtension | Gets the length of the rod's top extension into structure. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsRodLockedWithHost | Checks if the rod is locked with the host. The method is applicable only for bearer hanger. |
|  | SetBearerExtension | Sets the bearer extension. The method is applicable only for bearer hanger. |
|  | SetRodEndPosition | Sets the position of the rod end. The method is applicable only for bearer hanger. |
|  | SetRodLength | Set the rod length of the hanger for the specified rod index, excluding top extension. The hanger must not be set to be auto-hosted. |
|  | SetRodLockedWithHost | Locks the rod with the host. The method is applicable only for bearer hanger. |
|  | SetRodStructureExtension | Set the length of the rod's top extension into structure. The rod must be attached to structure. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

A fabrication part may have one or more rods. The FabricationRodInfo stores the rod information of the fabrication part.

#### Reference

Autodesk.Revit.DB Namespace